Revit 2027 API
ViewPrintedEventArgs.View Property
 The view that was printed.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public View View { get; }
Public ReadOnly Property View As View
	Get
public:
property View^ View {
	View^ get ();
}
member View : View with get
Property Value
View
See Also
Reference
ViewPrintedEventArgs Class
Autodesk.Revit.DB.Events Namespace